Revit 2027 API
STEPExportOptions.ApplicationProtocol Property
 The Application Protocol of the exported STEP file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public STEPApplicationProtocol ApplicationProtocol { get; set; }
Public Property ApplicationProtocol As STEPApplicationProtocol
	Get
	Set
public:
property STEPApplicationProtocol ApplicationProtocol {
	STEPApplicationProtocol get ();
	void set (STEPApplicationProtocol value);
}
member ApplicationProtocol : STEPApplicationProtocol with get, set
Property Value
STEPApplicationProtocol
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
STEPExportOptions Class
Autodesk.Revit.DB Namespace